import pandas as pd

data = {
    'order_id': [101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115],
    'date': [
        '2024-02-03', '2024-02-05', '2024-02-07', '2024-02-10', '2024-02-14',
        '2024-03-01', '2024-03-03', '2024-03-08', '2024-03-12', '2024-03-20',
        '2024-04-02', '2024-04-05', '2024-04-11', '2024-04-18', '2024-04-25',
    ],
    'client':   ['Олег', 'Маша', 'Олег', 'Ира', 'Маша',
                 'Олег', 'Петя', 'Ира', 'Маша', 'Петя',
                 'Олег', 'Ира', 'Маша', 'Петя', 'Олег'],
    'city':     ['Москва', 'СПб', 'Москва', 'Казань', 'СПб',
                 'Москва', 'Сочи', 'Казань', 'СПб', 'Сочи',
                 'Москва', 'Казань', 'СПб', 'Сочи', 'Москва'],
    'product':  ['Монитор', 'Мышь', 'Клавиатура', 'Ноутбук', 'Монитор',
                 'Ноутбук', 'Мышь', 'Монитор', 'Клавиатура', 'Ноутбук',
                 'Мышь', 'Монитор', 'Ноутбук', 'Клавиатура', 'Мышь'],
    'quantity': [1, 3, 2, 1, 2, 1, 5, 1, 2, 1, 4, 2, 1, 3, 2],
    'price':    [25000, 1500, 3000, 68000, 25000, 70000, 1500, 22000, 3000,
                 75000, 1500, 22000, 65000, 3000, 1500],
}

df = pd.DataFrame(data)
df['date'] = pd.to_datetime(df['date'])
df['total'] = df['quantity'] * df['price']

print(df)

# print("1.1. Сколько строк и столбцов в df?")
# print(f"строк: {df.shape[0]}, колонок: {df.shape[1]}")
#
# print("1.2. Какие типы у столбцов date, total, customer?")
# print(f"типы date: {df.dtypes["date"]}, total: {df.dtypes["total"]}, customer: {df.dtypes["customer"]}")
#
# print("1.3. Сколько уникальных товаров в датасете?")
# value_counts_df = df["product"].value_counts()
# flag = False
# for value,counts in value_counts_df.items():
#     if counts == 1:
#         print(value)
#         flag = True
#
# if not flag:
#     print("Уникального товара нет")
#
# print("1.4. Какая максимальная цена среди всех заказов?")
# print(f"максимальная цена - {df['price'].max()}")
#
# print("1.5. Сколько всего денег было заработано (total по всем заказам)?")
# print(f"сумма - {df['total'].sum()}")
#
# print("1.6. Выведи первые 3 строки датасета")
# print(df.head(3))
#
# print("1.7. Выведи последние 2 строки датасета.")
# print(df.tail(2))
#
# print("2.1. Выведи только столбец customer.")
# print(df["customer"])
#
# print("2.2. Выведи таблицу из столбцов order_id, customer, total.")
# print(df[["order_id","customer","total"]])
#
# print("2.3. Сколько всего денег во всём датасете?")
# print(f"сумма - {df['total'].sum()}")
#
# print("2.4. Какая максимальная цена (price) в датасете?")
# print(df["price"].max())
#
# print("2.5. Какая средняя quantity в датасете?")
# print(df["quantity"].mean())

print("3.1. Выведи первую строку через .iloc.")
print(df.loc[0])
print("--------------------------------------------")
print("3.2. Выведи последнюю строку через .iloc.")
print(df.iloc[-1])
print("--------------------------------------------")
print("3.3. Выведи первые 5 строк и первые 3 столбца.")
print(df.iloc[0:5,0:3])
print("--------------------------------------------")
print("3.4. Выведи последние 4 строки и столбцы с позициями 2 и 7.")
print(df.iloc[-4:,[2,7]])
print("--------------------------------------------")
print("3.5. Выведи строку с позицией 4, столбец с позицией 6. Какой это столбец по имени? Какое значение?")
print(df.iloc[[4],[6]])
print(f"Наименование столбца - {df.columns[6]},значение - {df.iloc[4,6]}")
print("--------------------------------------------")
print("3.6. Выведи строки по позициям [0, 7, 14] и столбцы [2, 3, 7].")
print(df.iloc[[0,7,14],[2,3,7]])
print("--------------------------------------------")
print("5.1. Заказы клиента Олег.")
print(df[df['client']=="Олег"])
print("--------------------------------------------")
print("5.2. Заказы, где quantity >= 2.")
print(df[df['quantity'] >= 2])
print("--------------------------------------------")
print("5.3. Заказы, где total > 30000 и city == 'Москва'.")
print(df[(df['total'] > 30000) & (df['city'] == 'Москва')])
print("--------------------------------------------")
print("5.4. Заказы из Москвы или Сочи (через .isin).")
print(df[df['city'].isin(['Москва', 'Сочи'])])
print("--------------------------------------------")
print("5.5. Заказы товаров «Мышь» или «Клавиатура» (через .isin).")
print(df[df['product'].isin(['Мышь', 'Клавиатура'])])
print("--------------------------------------------")
print("5.6. Заказы, сделанные не в СПб.")
print(df[~df['city'].isin(['СПб'])])
print("--------------------------------------------")
print("5.7. Клиенты, чьё имя начинается на «М».")
print(df[df["client"].str.startswith("М")])
print("--------------------------------------------")
print("5.8. Товары, содержащие букву «о» (через .str.contains, не забудь na=False).")
print(df[df['product'].str.contains('о', na=False)])
print("5.9. Сколько заказов с price > 20000?")
print(df[df['price'] > 20000].shape[0])
print("5.10. Через .loc установи total = 0 для всех заказов из Сочи. Выведи только order_id, city, total.")
df.loc[df['city'] == 'Сочи', 'total'] = 0
print(df.loc[:, ['order_id','city', 'total']])



